import pandas as pd

def get_data_task_1():
    """Таблиця 8.4: Питома вага, Змінність, Фондоозброєність"""
    data = {
        'Питома вага покупних виробів': [0.40, 0.26, 0.40, 0.50, 0.40, 0.19, 0.25, 0.44, 0.17, 0.39],
        'Коефіцієнт змінності устаткування': [1.37, 1.49, 1.44, 1.42, 1.35, 1.39, 1.16, 1.27, 1.16, 1.25],
        'Фондоозброєність праці': [6.4, 7.8, 9.76, 7.9, 5.35, 9.9, 4.5, 4.88, 3.46, 3.6]
    }
    return pd.DataFrame(data, index=range(1, 11))

def get_data_task_2():
    """Таблиця 8.5: Питома вага, Змінність, Премії"""
    data = {
        'Питома вага покупних виробів': [0.40, 0.26, 0.40, 0.50, 0.40, 0.19, 0.25, 0.44, 0.17, 0.39],
        'Коефіцієнт змінності устаткування': [1.37, 1.49, 1.44, 1.42, 1.35, 1.39, 1.16, 1.27, 1.16, 1.25],
        'Премії та винагороди': [1.23, 1.04, 1.8, 0.43, 0.88, 0.57, 1.75, 1.70, 0.84, 0.60]
    }
    return pd.DataFrame(data, index=range(1, 11))

def get_data_task_3():
    """Таблиця 8.6: Продуктивність, Фондовіддача, Рентабельність"""
    data = {
        'Продуктивність праці': [9.26, 9.38, 12.11, 10.81, 9.35, 9.87, 8.17, 9.12, 5.88, 6.30],
        'Фондовіддача': [1.45, 1.3, 1.37, 1.65, 1.91, 1.68, 1.94, 1.89, 1.94, 2.06],
        'Рентабельність': [13.26, 10.16, 13.72, 12.85, 10.63, 9.12, 25.83, 23.39, 14.68, 10.05]
    }
    return pd.DataFrame(data, index=range(1, 11))

def get_data_task_4():
    """Таблиця 8.7: Премії, Фондовіддача, Продуктивність"""
    data = {
        'Премії та винагороди': [1.23, 1.04, 1.8, 0.43, 0.88, 0.57, 1.75, 1.70, 0.84, 0.60],
        'Фондовіддача': [1.45, 1.3, 1.37, 1.65, 1.91, 1.68, 1.94, 1.89, 1.94, 2.06],
        'Продуктивність праці': [9.26, 9.38, 12.11, 10.81, 9.35, 9.87, 8.17, 9.12, 5.88, 6.30]
    }
    return pd.DataFrame(data, index=range(1, 11))

def get_data_task_5():
    """Таблиця 8.8: Фондовіддача, Вартість ОВФ, Продуктивність"""
    data = {
        'Фондовіддача': [1.96, 1.02, 1.85, 0.88, 0.62, 1.09, 1.60, 1.53, 1.40, 2.22],
        'Середньорічна вартість ОВФ': [45.44, 41.08, 136.14, 42.39, 37.39, 101.78, 47.55, 32.61, 103.25, 38.95],
        'Продуктивність праці': [6.22, 5.49, 6.5, 6.61, 4.32, 7.37, 7.02, 8.25, 8.15, 8.72]
    }
    return pd.DataFrame(data, index=range(1, 11))